package angryDragon.business.handlers.tgApiHandler;

public class BasicFunctions {
    /**
     * @return Приветственное сообщение
     */
    String getWelcomeMessage() {
        return "Добро пожаловать! " +
                "\nСоздайте профиль и питомца. Для этого введите /add_user и /add_pet";
    }

    /**
     * @return Справка по командам
     */
    String getHelpMessage() {
        return """
                🐉 Доступные команды для управления драконом:
                
                /start - Приветственное сообщение
                /help - Показать команды
                /games - Показать список доступных игр
                /cancel - Отменить текущий диалог
                
                
                👤 Управление пользователем:
                /add_user - Создать свой профиль
                /wallet - Показать баланс

                
                🐹 Управление питомцем:
                /add_pet - Создать дракона
                /pet_status - Посмотреть статус дракона
                /inventory - Показать инвентарь дракона
                /use_item - Использовать предмет
                
                
                🛒 Магазин:
                /shop - Показать каталог магазина
                /buy_item - Купить предмет
                /sell_item - Продать предмет
                """;
    }

    /**
     * @return Список игр
     */
    String games() {
        return """
                Список игр:
                  1) Wordle;
                  2) Виселица;
                  3) Однорукий бандит;
                  4) Крестики-нолики.
                """;
    }

}
